[
  {
    "id": 7,
    "explanation": "Amazon RDS Cross-Region Read Replicas allow a database to be asynchronously replicated to another AWS Region, enabling global redundancy and disaster recovery capabilities."
  },
  {
    "id": 10,
    "explanation": "Under the shared responsibility model, AWS secures the physical infrastructure, while customers are responsible for configuring the operating system, network settings, and firewall rules for their EC2 instances."
  },
  {
    "id": 15,
    "explanation": "AWS is responsible for managing and patching the underlying infrastructure, including the firmware on the physical hosts that run EC2 instances."
  },
  {
    "id": 20,
    "explanation": "Decoupling components ensures that failures in one part of the application do not cascade to others, improving fault tolerance and resilience."
  },
  {
    "id": 23,
    "explanation": "AWS Budgets allows customers to set custom cost and usage budgets and receive alerts when usage or spending exceeds defined thresholds."
  },
  {
    "id": 25,
    "explanation": "Only the Enterprise Support plan includes a designated Technical Account Manager (TAM), who provides proactive guidance and architectural reviews."
  },
  {
    "id": 26,
    "explanation": "A core reliability principle of the AWS Well-Architected Framework is the ability to recover from failure by automatically restoring services and resources."
  },
  {
    "id": 28,
    "explanation": "The AWS Cloud allows customers to scale resources up or down on demand, eliminating the need to predict future capacity requirements."
  },
  {
    "id": 29,
    "explanation": "AWS Lambda is a fully managed compute service that runs code without requiring customers to provision or manage servers."
  },
  {
    "id": 31,
    "explanation": "The AWS Software Development Kit (SDK) allows developers to programmatically interact with AWS services from application code."
  },
  {
    "id": 38,
    "explanation": "AWS pricing is based on a pay-as-you-go model with variable costs, meaning customers pay only for what they use and can scale usage up or down."
  },
  {
    "id": 43,
    "explanation": "Amazon EC2 allows customers to install, configure, and manage their own database software, making it suitable for self-managed databases."
  },
  {
    "id": 44,
    "explanation": "Enterprise Support includes a Technical Account Manager (TAM) who provides proactive guidance, architectural best practices, and support planning."
  },
  {
    "id": 48,
    "explanation": "Both Business and Enterprise Support plans provide access to the full set of AWS Trusted Advisor checks, including security, performance, and cost optimization."
  },
  {
    "id": 49,
    "explanation": "AWS WAF and Amazon CloudFront integrate with AWS Shield to help protect applications against Distributed Denial of Service (DDoS) attacks."
  },
  {
    "id": 50,
    "explanation": "When calculating cloud TCO on AWS, compute, storage, and data transfer costs must be included because these are the primary usage-based billing components."
  }
]
