[
  {
    "id": 1,
    "explanation": "Under the AWS shared responsibility model, AWS is responsible for the physical security of data centers, including physical and environmental controls. The customer remains responsible for the guest operating system and applications."
  },
  {
    "id": 2,
    "explanation": "AWS Elastic Beanstalk and AWS OpsWorks are used to deploy applications. AWS Config manages configurations, Application Discovery Service analyzes existing environments, and Amazon Kinesis is used for data streaming."
  },
  {
    "id": 3,
    "explanation": "Amazon Connect is a fully managed cloud-based contact center service that allows companies to quickly set up and operate call centers."
  },
  {
    "id": 4,
    "explanation": "AWS Pricing Calculator allows customers to estimate costs for most AWS services without needing an AWS account."
  },
  {
    "id": 5,
    "explanation": "An internet gateway is required to allow inbound and outbound internet traffic between a VPC and the public internet."
  },
  {
    "id": 6,
    "explanation": "Partial Upfront Reserved Instances provide the greatest savings for stable workloads that must run continuously for one year."
  },
  {
    "id": 7,
    "explanation": "Amazon RDS with Multi-AZ provides high availability by automatically replicating data to a standby instance in another Availability Zone and performing automatic failover."
  },
  {
    "id": 8,
    "explanation": "An IAM account password policy defines password complexity requirements such as minimum length, character types, and expiration."
  },
  {
    "id": 9,
    "explanation": "Customers are responsible for patching the guest operating system and applications running on AWS infrastructure."
  },
  {
    "id": 10,
    "explanation": "To meet PCI compliance requirements, customers must use AWS services that are in scope for PCI and apply PCI controls at the application layer."
  },
  {
    "id": 11,
    "explanation": "Amazon SQS enables sending, storing, and receiving messages between application components and supports FIFO queues to preserve message order."
  },
  {
    "id": 12,
    "explanation": "AWS Organizations allows consolidated billing by sending an invitation from the management account to another AWS account."
  },
  {
    "id": 13,
    "explanation": "AWS Budgets allows customers to create alerts based on actual or forecasted costs when thresholds are exceeded."
  },
  {
    "id": 14,
    "explanation": "AWS Elastic Beanstalk allows users to quickly deploy applications without deep infrastructure knowledge by automatically handling scaling and availability."
  },
  {
    "id": 15,
    "explanation": "AWS Trusted Advisor core checks are available to all AWS customers, even without a paid support plan."
  },
  {
    "id": 16,
    "explanation": "AWS Shield protects against DDoS attacks, and Amazon CloudFront helps absorb and mitigate malicious traffic using edge locations."
  },
  {
    "id": 17,
    "explanation": "AWS Artifact provides on-demand access to AWS compliance reports and certifications."
  },
  {
    "id": 18,
    "explanation": "Programmatic access is achieved by creating an IAM user with access keys and attaching a policy that grants limited Amazon RDS permissions."
  },
  {
    "id": 19,
    "explanation": "AWS Config records configuration changes, evaluates compliance, and can trigger remediation actions."
  },
  {
    "id": 20,
    "explanation": "Deploying instances across multiple Availability Zones eliminates single points of failure and increases application availability."
  },
  {
    "id": 21,
    "explanation": "Reserved Instances offer the lowest cost for predictable, long-term workloads that run continuously."
  },
  {
    "id": 22,
    "explanation": "AWS Personal Health Dashboard provides alerts about scheduled changes and issues that may affect specific AWS resources."
  },
  {
    "id": 23,
    "explanation": "Customers control access to Amazon RDS using security groups, while AWS manages the operating system and backups."
  },
  {
    "id": 24,
    "explanation": "When using AWS Lambda, customers are responsible for application logic and management, while AWS manages the underlying infrastructure."
  },
  {
    "id": 25,
    "explanation": "AWS Budgets notifies customers when costs or usage exceed defined thresholds."
  },
  {
    "id": 26,
    "explanation": "Amazon DynamoDB is a fully managed NoSQL database service designed for high scalability and low latency."
  },
  {
    "id": 27,
    "explanation": "Spot Instances allow customers to purchase unused EC2 capacity at a significantly reduced price."
  },
  {
    "id": 28,
    "explanation": "AWS Direct Connect requires an internet service provider and a colocation facility to establish a dedicated private connection."
  },
  {
    "id": 29,
    "explanation": "Amazon EC2 and AWS Lambda provide compute capacity, while Amazon S3 and Amazon EBS are storage services."
  },
  {
    "id": 30,
    "explanation": "AWS CodeCommit is a fully managed source control service that securely hosts private Git repositories."
  },
  {
    "id": 31,
    "explanation": "AWS Trusted Advisor helps identify security vulnerabilities and deviations from best practices within an AWS account."
  },
  {
    "id": 32,
    "explanation": "Replicating resources across multiple Availability Zones protects applications from single data center failures."
  },
  {
    "id": 33,
    "explanation": "Amazon SNS allows distributed applications to send both email and SMS notifications."
  },
  {
    "id": 34,
    "explanation": "Testing recovery procedures and enabling automatic recovery from failures are key principles for improving reliability."
  },
  {
    "id": 35,
    "explanation": "AWS Global Accelerator and Amazon CloudFront enable global content delivery with low latency and high transfer speeds."
  },
  {
    "id": 36,
    "explanation": "AWS Direct Connect provides a private, low-latency, and highly reliable network connection to AWS."
  },
  {
    "id": 37,
    "explanation": "AWS Artifact allows customers to retrieve compliance reports and regulatory documents on demand."
  },
  {
    "id": 38,
    "explanation": "AWS WAF protects web applications from common attacks such as SQL injection and cross-site scripting."
  },
  {
    "id": 39,
    "explanation": "Deploying multiple instances across multiple Availability Zones ensures high availability and fault tolerance."
  },
  {
    "id": 40,
    "explanation": "Reserved Instances provide the greatest cost savings for steady-state databases running over multiple years."
  },
  {
    "id": 41,
    "explanation": "The IAM credential report provides a complete view of IAM users, passwords, and access key status."
  },
  {
    "id": 42,
    "explanation": "Consolidated billing provides a single bill for multiple accounts and enables volume discounts."
  },
  {
    "id": 43,
    "explanation": "On-Demand Instances are ideal for short-term traffic spikes when interruptions are not acceptable."
  },
  {
    "id": 44,
    "explanation": "AWS Config rules allow organizations to monitor and evaluate resource configuration changes for compliance."
  },
  {
    "id": 45,
    "explanation": "Amazon CloudFront delivers content from locations close to users, reducing latency and improving performance."
  },
  {
    "id": 46,
    "explanation": "The principle of least privilege means IAM policies should be applied only to users who require those permissions."
  },
  {
    "id": 47,
    "explanation": "Economies of scale allow AWS to offer lower variable costs due to large-scale purchasing."
  },
  {
    "id": 48,
    "explanation": "AWS Transit Gateway simplifies connectivity across thousands of VPCs and reduces operational complexity."
  },
  {
    "id": 49,
    "explanation": "Automatic scaling allows AWS customers to control costs as application demand changes unpredictably."
  },
  {
    "id": 50,
    "explanation": "AWS WAF inspects and filters web requests to block attacks such as SQL injection."
  }
]
