[
  {
    "id": 1,
    "explanation": "AWS Marketplace is a digital catalog that lets customers find, purchase, and deploy third-party software that runs on AWS. Solutions can be launched directly into an AWS account without manual installation."
  },
  {
    "id": 2,
    "explanation": "Amazon VPC lets you create an isolated virtual network inside AWS where you can define IP ranges, subnets, route tables, and gateways."
  },
  {
    "id": 3,
    "explanation": "Under the shared responsibility model, AWS is responsible for the security of the cloud, including physical data centers, hardware, and networking equipment."
  },
  {
    "id": 4,
    "explanation": "CloudFront uses edge locations, which are geographically distributed endpoints that cache and deliver content closer to users for lower latency."
  },
  {
    "id": 5,
    "explanation": "Multi-Factor Authentication (MFA) adds an extra security layer by requiring users to provide a second form of authentication in addition to their password."
  },
  {
    "id": 6,
    "explanation": "AWS CloudTrail records all API calls and identifies which user or role performed an action, such as terminating an EC2 instance."
  },
  {
    "id": 7,
    "explanation": "Amazon SNS is used to send notifications and alerts triggered by CloudWatch alarms via email, SMS, or other endpoints."
  },
  {
    "id": 8,
    "explanation": "The AWS Acceptable Use Policy defines prohibited activities such as abuse, illegal usage, and security violations."
  },
  {
    "id": 9,
    "explanation": "AWS replaces large upfront capital expenses with pay-as-you-go pricing, allowing customers to pay only for what they use."
  },
  {
    "id": 10,
    "explanation": "Auto Scaling and multiple Availability Zones improve fault tolerance by automatically replacing failed instances and distributing workloads across isolated data centers."
  },
  {
    "id": 11,
    "explanation": "Distributing compute load across multiple resources improves resilience, scalability, and performance, which aligns with AWS best practices."
  },
  {
    "id": 12,
    "explanation": "IAM best practices include enforcing password rotation and preventing password reuse to reduce the risk of compromised credentials."
  },
  {
    "id": 13,
    "explanation": "AWS Professional Services and AWS Partner Network (APN) partners provide expert, hands-on help for planning and executing cloud migrations."
  },
  {
    "id": 14,
    "explanation": "The Concierge team assists AWS Enterprise Support customers with billing, account, and invoicing issues."
  },
  {
    "id": 15,
    "explanation": "An application running across multiple Availability Zones is considered highly available because it can survive failures in a single data center."
  },
  {
    "id": 16,
    "explanation": "Availability Zones are separate data centers within the same Region, allowing high availability while meeting geographic or regulatory constraints."
  },
  {
    "id": 17,
    "explanation": "The AWS Pricing Calculator estimates the cost of running workloads on AWS and allows comparisons with on-premises environments."
  },
  {
    "id": 18,
    "explanation": "Disabling Reserved Instance sharing ensures that the Reserved Instance discount applies only to the account that purchased it."
  },
  {
    "id": 19,
    "explanation": "The AWS Abuse team handles reports of malicious or illegal activity, such as intrusion attempts originating from AWS resources."
  },
  {
    "id": 20,
    "explanation": "AWS Global Accelerator and Amazon CloudFront route users to the closest AWS edge locations, providing low latency and fast content delivery worldwide."
  },
  {
    "id": 21,
    "explanation": "AWS Lambda is serverless because AWS manages all servers and infrastructure while users only upload and run code."
  },
  {
    "id": 22,
    "explanation": "Subnets and Internet Gateways are core VPC components that define network segmentation and internet connectivity."
  },
  {
    "id": 23,
    "explanation": "AWS Budgets allow customers to define spending limits and receive alerts to prevent overspending."
  },
  {
    "id": 24,
    "explanation": "MFA and password policies strengthen login security by requiring additional authentication factors and strong passwords."
  },
  {
    "id": 25,
    "explanation": "Trusted Advisor provides security checks such as public S3 bucket permissions and whether the root user has MFA enabled."
  },
  {
    "id": 26,
    "explanation": "AWS KMS is used to create, manage, and control cryptographic keys for encrypting and decrypting data."
  },
  {
    "id": 27,
    "explanation": "Trusted Advisor identifies cost-saving opportunities and security risks based on how AWS resources are configured."
  },
  {
    "id": 28,
    "explanation": "AWS manages the physical infrastructure and server capacity planning, removing these responsibilities from customers."
  },
  {
    "id": 29,
    "explanation": "Using Multi-AZ deployments increases fault tolerance, which is part of the Reliability pillar of the Well-Architected Framework."
  },
  {
    "id": 30,
    "explanation": "AWS VPN and Direct Connect provide secure network connections between on-premises environments and AWS."
  },
  {
    "id": 31,
    "explanation": "AWS Billing and Cost Management lets users view invoices, track usage, and manage budgets."
  },
  {
    "id": 32,
    "explanation": "Availability Zones are independent data centers with redundant power, networking, and connectivity within a Region."
  },
  {
    "id": 33,
    "explanation": "VPC Flow Logs capture network traffic information for troubleshooting, security analysis, and auditing."
  },
  {
    "id": 34,
    "explanation": "Auto Scaling automatically adjusts capacity based on demand, removing the need for manual capacity planning."
  },
  {
    "id": 35,
    "explanation": "The Concierge team is only available to Enterprise Support customers and provides billing and account assistance."
  },
  {
    "id": 36,
    "explanation": "Amazon RDS is a managed database service that automates patching, backups, and maintenance."
  },
  {
    "id": 37,
    "explanation": "To use a new AWS Region, customers simply deploy resources there; no contract or setup is required."
  },
  {
    "id": 38,
    "explanation": "Dedicated Hosts provide physical servers allocated to a single customer, meeting compliance and licensing requirements."
  },
  {
    "id": 39,
    "explanation": "AWS KMS and AWS CloudHSM both generate and manage encryption keys used to protect sensitive data."
  },
  {
    "id": 40,
    "explanation": "The AWS TCO Calculator estimates the cost difference between on-premises infrastructure and AWS after migration."
  },
  {
    "id": 41,
    "explanation": "AWS Professional Services and APN partners help assess, plan, and execute cloud migrations."
  },
  {
    "id": 42,
    "explanation": "AWS CloudHSM provides dedicated hardware security modules for customers with strict compliance requirements."
  },
  {
    "id": 43,
    "explanation": "Customers are responsible for securing EC2 operating systems and configuring network security controls such as security groups and ACLs."
  },
  {
    "id": 44,
    "explanation": "AWS Lambda runs code in response to events, making it ideal for event-driven architectures."
  },
  {
    "id": 45,
    "explanation": "AWS allows customers to use services without long-term contracts, enabling flexible, pay-as-you-go pricing."
  },
  {
    "id": 46,
    "explanation": "S3 cross-region replication supports buckets owned by the same or different AWS accounts."
  },
  {
    "id": 47,
    "explanation": "Under the shared responsibility model, customers are responsible for managing their application software."
  },
  {
    "id": 48,
    "explanation": "Agility allows companies to quickly experiment, deploy, and iterate new features without long provisioning cycles."
  },
  {
    "id": 49,
    "explanation": "Cost and Usage Reports and billing alerts help customers monitor spending and detect unexpected charges."
  },
  {
    "id": 50,
    "explanation": "Amazon Route 53 allows customers to register and manage DNS domain names and route internet traffic."
  }
]
